# Exploratory Notebook

In [1]:
import pandas as pd
import sqlite3
import matplotlib as plt

## DATA DISCOVERY

- Connecting to im.db

In [2]:
#Connecting the im.db SQL database

conn = sqlite3.connect('../Data/im.db')

In [3]:
# Reading table movie_basic 
df_mb = pd.read_sql("""

SELECT *
FROM movie_basics

""", conn)

df_mb

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [4]:
df_mb.columns

Index(['movie_id', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [5]:
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [6]:
df_mb['genres'].isna().sum()

5408

In [7]:
df_mb['runtime_minutes'].isna().sum()

31739

In [8]:
# DATA cleanning, we want to unify the database by dropping Null value from all columns
columns_to_drop_na = ['movie_id', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres']
df_mb.dropna(subset=columns_to_drop_na, inplace=True)

In [9]:
#Verification
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 112232 entries, 0 to 146139
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         112232 non-null  object
 1   primary_title    112232 non-null  object
 2   original_title   112232 non-null  object
 3   start_year       112232 non-null  int64
 4   runtime_minutes  112232 non-null  float64
 5   genres           112232 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.0+ MB

In [10]:
df_mb['genres'].isna().sum()

0

In [11]:
df_mb['runtime_minutes'].isna().sum()

0

#Data cleaning : Let's cleann the genres column
df_mb['genres'] = df_mb['genres'].str.split(',') 
df_mb = df_mb[df_mb['genres'].notnull()]
df_mb = df_mb.explode('genres')
df_mb.to_sql('cleaned_movies', conn, if_exists='replace')
df_mb

df_mb = df_mb[df_mb['genres'].notnull()]

df_mb = df_mb.explode('genres')

df_mb.to_sql('cleaned_movies', conn, if_exists='replace')
df_mb

## Movie_Ratings table

In [12]:
#Reading movie_ratings

df_mr = pd.read_sql("""

SELECT *
FROM movie_ratings

""", conn)

df_mr

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [13]:
df_mr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

## Movie_akas table

In [90]:
#Reading movie_ratings
df_ma = pd.read_sql("""

SELECT *
FROM movie_akas

""", conn)

df_ma

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [91]:
df_ma.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [92]:
df_ma.columns

Index(['movie_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')

In [93]:
#Data cleanning
columns_to_drop_na = ['region', 'language', 'types' ]
df_ma.dropna(subset=columns_to_drop_na, inplace=True)

In [94]:
df_ma.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31069 entries, 8 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           31069 non-null  object
 1   ordering           31069 non-null  int64
 2   title              31069 non-null  object
 3   region             31069 non-null  object
 4   language           31069 non-null  object
 5   types              31069 non-null  object
 6   attributes         0 non-null      object
 7   is_original_title  31069 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 2.1+ MB

df_5a = pd.read_sql("""

SELECT *, MAX (averagerating) AS av_rating , MAX(numvotes) AS num_votes
FROM movie_basics
    JOIN movie_ratings 
       USING(movie_id)
    JOIN movie_akas ma
        USING(movie_id)
    GROUP BY movie_id
    ORDER BY num_votes DESC;

""", conn)

df_5a.head(10)

In [95]:
#Joining MOVIE RATING, BASICS, AKAS INTO df_m
df_m = pd.read_sql("""

SELECT movie_id, primary_title, runtime_minutes, genres, region, language, MAX (averagerating) AS av_rating , MAX(numvotes) AS num_votes
FROM movie_basics
    JOIN movie_ratings 
       USING(movie_id)
    JOIN movie_akas ma
        USING(movie_id)
    GROUP BY movie_id
    ORDER BY num_votes DESC;



""", conn)
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,"Action,Adventure,Sci-Fi",None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,"Action,Thriller",None,None,8.4,1387769
2,tt0816692,Interstellar,169.0,"Adventure,Drama,Sci-Fi",None,None,8.6,1299334
3,tt1853728,Django Unchained,165.0,"Drama,Western",None,None,8.4,1211405
4,tt0848228,The Avengers,143.0,"Action,Adventure,Sci-Fi",None,None,8.1,1183655
...,...,...,...,...,...,...,...,...
69572,tt10043732,Oblepikhovoe leto,87.0,"Biography,Drama",None,None,6.4,5
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,"Action,Drama",GB,None,7.4,5

In [96]:
df_m.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69577 entries, 0 to 69576
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         69577 non-null  object
 1   primary_title    69577 non-null  object
 2   runtime_minutes  62830 non-null  float64
 3   genres           68937 non-null  object
 4   region           32697 non-null  object
 5   language         0 non-null      object
 6   av_rating        69577 non-null  float64
 7   num_votes        69577 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 4.2+ MB

In [97]:
#more Data cleanning
columns_to_drop_na = ['runtime_minutes']
df_m.dropna(subset=columns_to_drop_na, inplace=True)

In [98]:
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,"Action,Adventure,Sci-Fi",None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,"Action,Thriller",None,None,8.4,1387769
2,tt0816692,Interstellar,169.0,"Adventure,Drama,Sci-Fi",None,None,8.6,1299334
3,tt1853728,Django Unchained,165.0,"Drama,Western",None,None,8.4,1211405
4,tt0848228,The Avengers,143.0,"Action,Adventure,Sci-Fi",None,None,8.1,1183655
...,...,...,...,...,...,...,...,...
69572,tt10043732,Oblepikhovoe leto,87.0,"Biography,Drama",None,None,6.4,5
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,"Action,Drama",GB,None,7.4,5

In [99]:
df_m.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62830 entries, 0 to 69576
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         62830 non-null  object
 1   primary_title    62830 non-null  object
 2   runtime_minutes  62830 non-null  float64
 3   genres           62391 non-null  object
 4   region           27861 non-null  object
 5   language         0 non-null      object
 6   av_rating        62830 non-null  float64
 7   num_votes        62830 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 4.3+ MB

In [100]:
#Data cleaning : Let's cleann the genres column
df_m['genres'] = df_m['genres'].str.split(',')

In [101]:
df_m = df_m[df_m['genres'].notnull()]

In [102]:
df_m = df_m.explode('genres')

In [103]:
df_m.to_sql('cleaned_movies', conn, if_exists='replace')
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,Action,None,None,8.8,1841066
0,tt1375666,Inception,148.0,Adventure,None,None,8.8,1841066
0,tt1375666,Inception,148.0,Sci-Fi,None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,Action,None,None,8.4,1387769
1,tt1345836,The Dark Knight Rises,164.0,Thriller,None,None,8.4,1387769
...,...,...,...,...,...,...,...,...
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,Action,GB,None,7.4,5
69576,tt0276568,To Chase a Million,97.0,Drama,GB,None,7.4,5

In [106]:
df_m['w_avg'] = ((df_m['av_rating']*df_m['num_votes'])/ sum(df_m['num_votes']))*100
df_m.head(20)

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes,w_avg
0,tt1375666,Inception,148.0,Action,None,None,8.8,1841066,2.365517
0,tt1375666,Inception,148.0,Adventure,None,None,8.8,1841066,2.365517
0,tt1375666,Inception,148.0,Sci-Fi,None,None,8.8,1841066,2.365517
1,tt1345836,The Dark Knight Rises,164.0,Action,None,None,8.4,1387769,1.702043
1,tt1345836,The Dark Knight Rises,164.0,Thriller,None,None,8.4,1387769,1.702043
2,tt0816692,Interstellar,169.0,Adventure,None,None,8.6,1299334,1.631524
2,tt0816692,Interstellar,169.0,Drama,None,None,8.6,1299334,1.631524
2,tt0816692,Interstellar,169.0,Sci-Fi,None,None,8.6,1299334,1.631524
3,tt1853728,Django Unchained,165.0,Drama,None,None,8.4,1211405,1.485740
3,tt1853728,Django Unchained,165.0,Western,None,None,8.4,1211405,1.485740
4,tt0848228,The Avengers,143.0,Action,None,None,8.1,1183655,1.399859
4,tt0848228,The Avengers,143.0,Adventure,None,None,8.1,1183655,1.399859
4,tt0848228,The Avengers,143.0,Sci-Fi,None,None,8.1,1183655,1.399859
5,tt0993846,The Wolf of Wall Street,180.0,Biography,None,None,8.2,1035358,1.239591
5,tt0993846,The Wolf of Wall Street,180.0,Crime,None,None,8.2,1035358,1.239591
5,tt0993846,The Wolf of Wall Street,180.0,Drama,None,None,8.2,1035358,1.239591
6,tt1130884,Shutter Island,138.0,Mystery,None,None,8.1,1005960,1.189707
6,tt1130884,Shutter Island,138.0,Thriller,None,None,8.1,1005960,1.189707
7,tt2015381,Guardians of the Galaxy,121.0,Action,None,None,8.1,948394,1.121626
7,tt2015381,Guardians of the Galaxy,121.0,Adventure,None,None,8.1,948394,1.121626

In [ ]:
#df_m.to_csv('movie_clean-a.csv')

In [ ]:
import matplotlib.pyplot as plt


# Plot the 'num_votes' column
plt.plot(df_5b['num_votes'], marker='o', linestyle='-')

# Add labels and title
plt.xlabel('Index')
plt.ylabel('Number of Votes')
plt.title('popularity by num_votes')

# Show the plot
plt.show()

In [ ]:

# bar chart 
fig, ax = plt.subplots(figsize=(12, 8))
ax.bar(df_5['genres'].values, df_5['num_votes'])
ax.set_ylabel('Number of Movies')
ax.set_title('Popularity of movies by Genre')
ax.set_xticklabels(df_5['genres'].index, rotation=45, ha='right')

# show plot
plt.show()

## Reading Bom.movies database

In [ ]:
df_mg = pd.read_csv('../Data/bom.movie_gross.csv.gz')

In [ ]:
df_mg

In [ ]:
df_mg.info()

In [ ]:
df_mg.columns

In [ ]:
df_mg.isna().sum()

In [ ]:
columns_to_drop_na = ['title', 'studio', 'domestic_gross', 'foreign_gross', 'year']
df_mg.dropna(subset=columns_to_drop_na, inplace=True)
df_mg.isna().sum()

In [ ]:
df_mg.info()

In [ ]:
df_mg

In [ ]:
df_mg['domestic_gross'] = pd.to_numeric(df_mg['domestic_gross'], errors='coerce').fillna(0).astype(int)
df_mg['foreign_gross'] = pd.to_numeric(df_mg['foreign_gross'], errors='coerce').fillna(0).astype(int)

In [ ]:
df_mg.info()

In [ ]:
df_mg['total_gross'] = df_mg['domestic_gross'] + df_mg['foreign_gross']

In [ ]:
df_gross= df_mg.head(20)

In [ ]:
df_gross

In [ ]:
#df_gross.to_csv('movie_gross.csv')

## Reading the rt.reviews

In [ ]:
df_rt = pd.read_csv('../Data/rt.reviews.tsv.gz', sep='\t', encoding='latin-1')

In [ ]:
df_rt.info()

In [ ]:
df_rt

In [ ]:
df_rt.info()

In [ ]:
df_rt.columns

In [ ]:
columns_to_drop_na = ['id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher',
       'date']
df_rt.dropna(subset=columns_to_drop_na, inplace=True)

In [ ]:
df_rt.shape

In [ ]:
df_rt.info()

In [ ]:
df_rt['top_critic'].unique()

In [ ]:
df_rt = df_rt[df_rt['top_critic'] >= 1]

In [ ]:
df_rt

In [ ]:
df_rt['top_critic'].value_counts

In [ ]:
df_rt['rating'].value_counts()

In [ ]:
# Convert 'rating' column to numeric values, coerce non-numeric values to NaN
#df_rt.loc[:, 'rating'] = pd.to_numeric(df_rt['rating'], errors='coerce')

# Drop rows where 'rating' is not numeric
#df_rt = df_rt.dropna(subset=['rating'])

In [ ]:
df_rt['rating']

In [ ]:
df_rt[df_rt.duplicated()]

## Reading Rotten tomatos movies

In [ ]:
df_rtr = pd.read_csv('../Data/rt.movie_info.tsv.gz', sep='\t' )
df_rtr

In [ ]:
df_rtr.info()

## Reading the numbers

In [65]:
df_n = pd.read_csv('../Data/tn.movie_budgets.csv.gz')

In [66]:
df_n

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [67]:
df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [68]:
# converting the object columns into integer
#roi_df['production_budget'] = pd.to_numeric(roi_df['production_budget'].str.replace('[\$,]', '', regex=True), errors='coerce')

df_n['production_budget'] = pd.to_numeric(df_n['production_budget'].str.replace('[\$,]', '', regex=True), errors='coerce')

In [70]:
df_n['worldwide_gross'] = pd.to_numeric(df_n['worldwide_gross'].str.replace('[\$,]', '', regex=True), errors='coerce')

In [69]:
df_n['domestic_gross'] = pd.to_numeric(df_n['domestic_gross'].str.replace('[\$,]', '', regex=True), errors='coerce')

In [71]:
df_n

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,7000,0,0
5778,79,"Apr 2, 1999",Following,6000,48482,240495
5779,80,"Jul 13, 2005",Return to the Land of Wonders,5000,1338,1338
5780,81,"Sep 29, 2015",A Plague So Pleasant,1400,0,0
5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,181041

In [72]:
#convert dates into datetime type

df_n['release_date'] = pd.to_datetime(df_n['release_date'], errors='coerce')

In [73]:
df_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 271.2+ KB

In [77]:
#ROI calculation
df_n['ROI'] = (((df_n['worldwide_gross'] - df_n['production_budget']) / df_n['production_budget']) * 100).apply('{:.2f}%'.format)

In [78]:
df_n

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,ROI
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,553.26%
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,154.67%
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-57.21%
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,324.38%
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,315.37%
...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,7000,0,0,-100.00%
5778,79,1999-04-02,Following,6000,48482,240495,3908.25%
5779,80,2005-07-13,Return to the Land of Wonders,5000,1338,1338,-73.24%
5780,81,2015-09-29,A Plague So Pleasant,1400,0,0,-100.00%
5781,82,2005-08-05,My Date With Drew,1100,181041,181041,16358.27%